files/paper-reviews/1.1 Star Formation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-02-15 Tue 13:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ChongChong He" />
<link rel="stylesheet" href="css/org.css" type="text/css" />
<link rel="stylesheet" href="css/custom.css" type="text/css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="./index.html"> HOME </a>
</div><div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org16ad474">1. Top</a></li>
<li><a href="#org82b3ee1">2. Star formation</a>
<ul>
<li><a href="#orge08b646">2.1. Star formation: general</a>
<ul>
<li><a href="#org364f787">2.1.1. Krumholz:2011a, Star Formation in Molecular Clouds</a></li>
</ul>
</li>
<li><a href="#org82abe98">2.2. Star formation: theories</a>
<ul>
<li><a href="#orga63168e">2.2.1. Padoan1997</a></li>
<li><a href="#org5ce49df">2.2.2. Padoan2002</a></li>
<li><a href="#orgb9b1950">2.2.3. Hennebelle2008</a></li>
<li><a href="#orgaca2222">2.2.4. Hopkins2012,2012a</a></li>
<li><a href="#orgbf30605">2.2.5. McKee2007, Theory of Star Formation</a></li>
<li><a href="#orgbff26b2">2.2.6. Offner2014:</a></li>
<li><a href="#org492b71e">2.2.7. Heath2020: On the orbital evolution of binaries with circumbinary</a></li>
</ul>
</li>
<li><a href="#org9852e3b">2.3. First Stars</a></li>
</ul>
</li>
<li><a href="#org7ac0aac">3. GMC</a>
<ul>
<li><a href="#org747aba7">3.1. Observations</a>
<ul>
<li><a href="#org44e87b6">3.1.1. DessaugesZavadsky2019 (Hot paper, Sep 27, 2019)</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div class="HTML" id="orgce14242">
<p>
\(
	  \newcommand{\dif}{\,\mathrm{d}}
	  \newcommand{\sci}[2]{#1 \times 10^{#2}}
	  \def\num#1{\numx#1}\def\numx#1e#2{{#1}\mathrm{e}{#2}}
	  \newcommand{\msun}{{\rm M}_\odot}
	  \newcommand{\si}[1]{{\rm #1}}
\)
</p>

</div>

<div id="outline-container-org16ad474" class="outline-2">
<h2 id="org16ad474"><span class="section-number-2">1</span> Top</h2>
</div>

<div id="outline-container-org82b3ee1" class="outline-2">
<h2 id="org82b3ee1"><span class="section-number-2">2</span> Star formation</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orge08b646" class="outline-3">
<h3 id="orge08b646"><span class="section-number-3">2.1</span> Star formation: general</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org364f787" class="outline-4">
<h4 id="org364f787"><span class="section-number-4">2.1.1</span> Krumholz:2011a, Star Formation in Molecular Clouds</h4>
<div class="outline-text-4" id="text-2-1-1">
<ul class="org-ul">
<li>Star-forming clouds are generally cold, most of observational
techniques require on infrared, sub-millimeter, and radio observations</li>
<li>H2

<ul class="org-ul">
<li>In the high densities where stars form, H tends to be molecular, and
H2 is extremely hard to observe. (H atoms is easy to observe via 21
cm hyperfine line)

<ul class="org-ul">
<li>The first excited state is the J = 1 rotational state, is above
100 K, but dense ISM has T ~ 10 K. Also, because H2 is a
homonuclear molecule and have zero electric dipole moment, meaning
there is no J = 1 -&gt; 0 emission.</li>
</ul></li>

<li>Observing the dust

<ul class="org-ul">
<li>Dust grains emit thermal radiation. They can absorb or emit
continuum radiation.</li>
</ul></li>
</ul></li>
</ul>

<p>
## Pillars of Creation
</p>

<p>
Eagle Nebula, shock wave produced by a supernova. 
</p>
</div>
</div>
</div>

<div id="outline-container-org82abe98" class="outline-3">
<h3 id="org82abe98"><span class="section-number-3">2.2</span> Star formation: theories</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-orga63168e" class="outline-4">
<h4 id="orga63168e"><span class="section-number-4">2.2.1</span> Padoan1997</h4>
<div class="outline-text-4" id="text-2-2-1">
<ul class="org-ul">
<li>One of the first models combining the effects of density fluctuations
and gravity to predict a CMF.</li>
<li>Assuming a lognormal density PDF and isothermal gas. Estimate the
number of regions in which the density would be sufficiently high so
that the Jeans mass is below a value.</li>
<li>Predicts a lognormal CMF with a peak and a power-law extension at high
masses</li>
<li>Limitations:

<ol class="org-ol">
<li>neglected local turbulent support</li>
<li>neglected size scale dependence of the gravitational instability</li>
</ol></li>
</ul>
</div>
</div>

<div id="outline-container-org5ce49df" class="outline-4">
<h4 id="org5ce49df"><span class="section-number-4">2.2.2</span> Padoan2002</h4>
<div class="outline-text-4" id="text-2-2-2">
<ul class="org-ul">
<li>Heuristic assumption that the size of each region followed the
characteristic size scale of postshock gas.</li>
<li>More naturally led to a power-law high-mass slope</li>
</ul>
</div>
</div>

<div id="outline-container-orgb9b1950" class="outline-4">
<h4 id="orgb9b1950"><span class="section-number-4">2.2.3</span> Hennebelle2008</h4>
<div class="outline-text-4" id="text-2-2-3">
<ul class="org-ul">
<li>Assumed gas log density is a Gaussian random field.</li>
<li>Density power spectrum gives the density distribution at all scales,
resolving the size limitation in padoan:1997</li>
<li>Turbulent + thermal support &#x2013;&gt; self-gravitating regions &#x2013;&gt; CMF with
a peak, a Salpeter-like power law at high masses.</li>
<li>One solution for the 'cloud-in-cloud' problem (Bond et al., 1991).</li>
<li>Including:

<ul class="org-ul">
<li>Turbulent fragmentation</li>
</ul></li>

<li>Missing:

<ul class="org-ul">
<li>Gravitationally induced fragmentation</li>
</ul></li>

<li>Result: agree well with mass spectrum of observed CO clumps, less with
the IMF-like CMF.</li>
</ul>
</div>
</div>

<div id="outline-container-orgaca2222" class="outline-4">
<h4 id="orgaca2222"><span class="section-number-4">2.2.4</span> Hopkins2012,2012a</h4>
<div class="outline-text-4" id="text-2-2-4">
<ul class="org-ul">
<li>Extended upon Hennebelle:2008</li>
<li>Encompass the entire galactic disk and include rotational support.</li>
<li>"Excursion set theory"</li>
</ul>
</div>
</div>

<div id="outline-container-orgbf30605" class="outline-4">
<h4 id="orgbf30605"><span class="section-number-4">2.2.5</span> McKee2007, Theory of Star Formation</h4>
<div class="outline-text-4" id="text-2-2-5">
<p>
Table of Contents of "Theory of Star Formation", by Christopher F.
McKee1 and Eve C. Ostriker
</p>

<ol class="org-ol">
<li>INTRODUCTION</li>
<li>BASIC PHYSICAL PROCESSES 2.1. Turbulence 2.1.1. Spatial correlations
of velocity and magnetic fields. 2.1.2. Turbulent dissipation
timescales. 2.1.3. Physical scales in turbulent flows. 2.2.
Self-Gravity 2.3. Magnetic Fields 2.3.1. Ionization.</li>
<li>MACROPHYSICS OF STAR FORMATION 3.1. Physical State of Giant Molecular
Clouds, Clumps, and Cores 3.1.1. Dynamics of giant molecular clouds
3.1.2. Clumps and cores. 3.2. Formation, Evolution, and Destruction
of GMCs 3.2.1. Cloud formation. 3.2.2. Cloud evolution and
destruction. 3.3. Core Mass Functions and the Initial Mass Function
3.3.1. Observations of the stellar initial mass function and the core
mass function. 3.3.2. Theoretical proposals and numerical results.
3.4. The Large-Scale Rate of Star Formation</li>
<li>MICROPHYSICS OF STAR FORMATION 4.1. Low-Mass Star Formation 4.1.1.
Theory of core collapse and protostellar infall. 4.1.1.1. Effects of
rotation. 4.1.1.2. Effects of magnetic fields. 4.1.2. Bondi-Hoyle
accretion. 4.1.3. Observations of low-mass star formation 4.1.3.1.
Brown dwarfs. 4.1.3.2. Binaries 4.2. Disks and Winds 4.2.1.
Observations of disks. 4.2.2. Accretion mechanisms. 4.2.2.1.
Hydrodynamic mechanisms. 4.2.2.2.MHDmechanisms. 4.2.2.3.
Self-gravitational mechanisms. 4.2.3. Disk clearing. 4.2.4.
Observations of young stellar object jets and outflows. 4.2.5.
Driving magnetohydrodynamic winds and jets. 4.2.6. Origins and
effects of outflows. 4.3. High-Mass Star Formation 4.3.1.
Protostellarinfall 4.3.2. Observations of high-mass protostars 4.3.3.
Forming stars in the presence of radiation pressure. 4.3.4.
Photoionization feedback: HII regions 4.3.5. Star formation in
clusters</li>
<li>OVERVIEW OF THE STAR-FORMATION PROCESS</li>
</ol>
</div>
</div>

<div id="outline-container-orgbff26b2" class="outline-4">
<h4 id="orgbff26b2"><span class="section-number-4">2.2.6</span> <a href="file:///Users/chongchonghe/Googledrive/Academic/Papers/O/Offner2014.pdf">Offner2014</a>:</h4>
<div class="outline-text-4" id="text-2-2-6">
<p>
The Origin and Universality of the Stellar Initial Mass Function
</p>

<ol class="org-ol">
<li>(Sec 2) Observations of IMF

<ul class="org-ul">
<li>Methods of deriving the IMF: 1. Measure the LF of a complete sample
of stars. 2. the LF is converted into a present-day mass function
(PDMF). 3. The PDMF is corrected for the star-formation history,
stellar evolution, cluster evolution, and binarity to obtain the
individual star IMF.</li>
<li>The Milky Ways have shown an near-universal IMF, expect the young
nuclear cluster in the Galactic center where the MF is flatter than
Salpeter.</li>
<li>There is no strong evidence for IMF variations within local
galaxies.</li>
<li>Extragalactic determinations of the IMF dynamically compared
mass-to-light retios to expectations of SPS models, or use spectral
features to determine the relative numbers of low-mass stars. While
elliptical galaxies show intriguing evidence for systematic IMF
variations, further study is required to confirm.</li>
</ul></li>

<li>(Sec 3.1) Observations of CMF

<ul class="org-ul">
<li>Observational methods and conclusions:

<ol class="org-ol">
<li>Millimeter continuum dust emission in nearby molecular clouds.

<ul class="org-ul">
<li>The mass spectrum was reminiscent of the Salpeter IMF slope.
The observed cores were the reservoirs that contribute most of
the eventual stellar masses.</li>
</ul></li>

<li>Near-infrared extinction maps, which complements the dust
emission measurements.

<ul class="org-ul">
<li>The mass spectrum has a shape similar to the Chabrier but is
shifted toward larger masses by a factor of ~3.</li>
</ul></li>

<li>Herschel data (most recent up to 2014)

<ul class="org-ul">
<li>High-mass slope comparable to Salpeter with a peak located at
~1 solar mass.</li>
</ul></li>
</ol></li>

<li>Similarity between the shapes of the CMF and the IMF at large
masses is reinforced.</li>
</ul></li>

<li><p>
(Sec 3.2) Analytical theories for the CMF
</p>

<p>
See this section: <a href="#org82abe98">Star formation: theories</a>
</p></li>

<li>(Sec 3.3) The CMF from numerical simulations

<ul class="org-ul">
<li>Padoan et al. (2007): only thermal support, spectrum too steep. Magnetic pressure support included, spectrum close to Salpeter exponent.</li>
<li>Schmidt et al. (2010): turbulent support is necessary maintain a Salpeter slope. Turbulent forcing (<b>?</b>): more compression on gas, smaller collapsing regions.</li>
<li>Smith el al. (2009): both turbulence and self-gravity. define CMF as prestellar cores on the basis of either gravitational potential or thermal and turbulent support; define IMF as sink masses. Conclusion: both CMF and SMF resembled the observed IMF.</li>
</ul></li>

<li><p>
(Sec 4) The link b/t the CMF and the IMF
</p>

<p>
Conditions for the shape of the IMF to derive directly from CMF:
</p>

<ol class="org-ol">
<li>All cores are destined to condense into stars</li>
<li>A universal core-to-star ratio</li>
<li>Core fragmentation must be self-similar</li>
<li>Cores condense at the same rate (??? depending on the timescale.</li>
</ol></li>

<li><p>
[TODO]{.todo .TODO} (Sec 4.1) Prestellar cores
</p>

<ul class="org-ul">
<li>State "TODO" from <span class="timestamp-wrapper"><span class="timestamp">[2020-03-24 Tue 16:48]</span></span></li>
</ul>

<p>
How do prestellar cores fragment?
</p>

<dl class="org-dl">
<dt><b>Thermal support</b></dt><dd>A fundamental quantity: the ratio of the core mass to Jeans mass, \(M_{\rm core} / M_{\rm Jeans}\), which depends on the monochromatic flux from the core, its distance, the dust temperature, the monochromatic mass-opacity (due to dust), and the mean gas-particle mass.</dd>

<dt><b>Non-thermal support</b></dt><dd>- <i>Kinematics/Internal velocity</i> - <i>Magnetic support</i> Crutcher et al. (2009) suggest that magnetic fields are not able to support prestellar cores against gravity. TODO: check in my sims - <i>Cores from column density maps</i> Although different methods of clump finding results in similar CMFs, the existence of the cores should be viewed with caution, particularly at low masses.</dd>
</dl></li>

<li>(Sec 4.2) Core fragmentation

<ul class="org-ul">
<li>The first unstable cores in these simulations are always around the
mean thermal Jeans mass, 1 Msol.</li>
<li>Formation of massive disks:

<ul class="org-ul">
<li>Important channel for forming brown dwarfs and very-low-mass H-burning stars (Bate et al., 2002)</li>
<li>Magnetic torques may efficiently remove angular momentum, preventing from forming massive disks.</li>
<li>Radiative feedback from the central star. Radiative heating of high accretion luminosity stabilizes the disk against fragmentation. If accretion is episodic, disk fragmentation can still occur. (Stamatellos:2012)</li>
</ul></li>
</ul></li>

<li>High-mass Cores and IMF

<ul class="org-ul">
<li>Observed CMF only extends to ~10 Msol ???</li>
<li>This should extend to higher masses (Oey, 2011, McKee and Tan, 2002)</li>
<li>Open questions: efficiency with which core gas forms stars (core fragmentation).

<ul class="org-ul">
<li>Idealized geometry: observation, CMF peak at 1 Msol, suggesting e=30% ???</li>
</ul></li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org492b71e" class="outline-4">
<h4 id="org492b71e"><span class="section-number-4">2.2.7</span> Heath2020: On the orbital evolution of binaries with circumbinary</h4>
<div class="outline-text-4" id="text-2-2-7">
<p>
discs
</p>

<p>
"We provide physical arguments, and then demonstrate with 3D hydrodynamical simulations, that thick (high pressure, high viscosity) discs drive sufficient accretion of high angular momentum material to force binary expansion, while in the more realistic case of thin (low pressure, low viscosity) discs there is less accretion and the binary shrinks."
</p>
</div>
</div>
</div>

<div id="outline-container-org9852e3b" class="outline-3">
<h3 id="org9852e3b"><span class="section-number-3">2.3</span> First Stars</h3>
</div>
</div>
<div id="outline-container-org7ac0aac" class="outline-2">
<h2 id="org7ac0aac"><span class="section-number-2">3</span> GMC</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org747aba7" class="outline-3">
<h3 id="org747aba7"><span class="section-number-3">3.1</span> Observations</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org44e87b6" class="outline-4">
<h4 id="org44e87b6"><span class="section-number-4">3.1.1</span> DessaugesZavadsky2019 (Hot paper, Sep 27, 2019)</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
Resolve GMCs in a typical MW progenitor at z=1: The "Cosmic Snake"
galaxy that is elongated by gravitational lensing.
</p>

<p>
<b>Telescope</b> : ALMA asdf asdfa asd. aSpell check. ?
</p>

<p>
<b>Technique</b> : CO(4-3) tracing
</p>

<p>
<b>Resolution</b> : 70 pc - 30 pc
</p>

<p>
<b>GMC properties</b> : 17 GMCs with masses, surface densities and Mach number all 10-100 times higher than present-day analogues. Inside 1.7 kpc central region
</p>

<p>
<b>GMC densities</b> : R = 30 pc to 210 pc, M = 8e6 Msol to 1e9 Msol, resulting in n = 1000 to 3000 cm-3
</p>

<p>
<b>Some results</b> : GMC mass function,
</p>

<ul class="org-ul">
<li>Other properties of the galaxy

<ul class="org-ul">
<li>SFR: 30 Msol/yr, typical at z=1.</li>
<li>Stellar mass: 4e10 Msol</li>
<li>Internal velocity dispersion: \(44 \pm 30\) km/s</li>
</ul></li>
</ul>

<p>
<b>Conclusion</b> : This corroborates the formation of molecular clouds by fragmentation of distant turbulent galactic gas disks.
</p>

<p>
<b>Takeaway</b> : New observations of GMCs in z=1 galaxies. Density 10 - 100 times higher than present-day analogues.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Author: ChongChong He</p><p></p><p><a href='https://www.astro.umd.edu/~chongchong/'>www.astro.umd.edu/~chongchong/</a></p>
</div>
</body>
</html>